/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: eshakita <eshakita@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/18 11:00:57 by eshakita          #+#    #+#             */
/*   Updated: 2021/10/20 15:53:31 by eshakita         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "iter.hpp"

/*
написать шаблоны функций:

Напишите шаблон функции iter, который принимает 3 параметра и ничего не возвращает.
Первый параметр - это адрес массива
второй - длина массива
третий - функция, вызываемая для каждого элемента массива.

Оберните свою работу в исполняемый файл, который доказывает,
что ваш шаблон функции iter работает с любым типом массива 
и/или с созданным шаблоном функции в качестве третьего параметра.
*/

int main( void ) 
{
    // int i_arr[10];
    // int i_size = 10;
    // std::cout << "int arr, size = " << i_size << std::endl;
    // for(int i = 0; i < i_size; i++)
    // {
    //     i_arr[i] = i;
    // }
    // ::iter(i_arr, i_size, print_arr_element);


    // float f_arr[10];
    // int size_f_arr = 10;
    // std::cout << "float arr, size = " << size_f_arr << std::endl;
    // for(int i = 0; i < size_f_arr; i++)
    // {
    //     f_arr[i] = i+0.5f;
    // }
    // ::iter(f_arr, size_f_arr, print_arr_element);


    // std::string str_arr[3] = {"first", "second", "third"};
    // std::cout << "string arr, size = " << 3 << std::endl;
    // ::iter(str_arr, 3, print_arr_element);
    // return 0; 
}
