/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.cpp                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: eshakita <eshakita@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/18 11:00:57 by eshakita          #+#    #+#             */
/*   Updated: 2021/10/21 16:26:51 by eshakita         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "Array.hpp"

/*
STACK - тип данный который работает по принципе "первый вошел - последний вышел"
в нем нет индексов как в массиве, а значит нельзя обратится к конкретному элементу.
Стек построен на списках, каждый элемент указывает на следующий, а последний на NULL;


*/

int main( void ) 
{
    return 0; 
}
