/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_envp_utils_continue.c                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: eshakita <eshakita@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/08/16 13:19:11 by eshakita          #+#    #+#             */
/*   Updated: 2021/08/16 14:55:04 by eshakita         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "includes/minishell.h"
/*
**	Считает кол-во строк
*/
int	num_size(char **en)
{
	int		i;

	i = 0;
	while (en[i])
		i++;
	return (i);
}

void	ft_gg_wp_the_end(void)
{
	printf("Ну поздравляю, хз как ты умудрился маллок запороть. GG WP!");
	exit (1);
}
